# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; org-confirm-babel-evaluate: nil; -*-
# NOTE: `org-src-preserve-indentation: t; org-edit-src-content: 0;` are options to ensure indentations are preserved for export to ipynb.
# NOTE: `org-confirm-babel-evaluate: nil;` means no confirmation will be requested before executing code blocks

#+TITLE: Magnetic Data Analysis
* Day Plots
Day Plots are scatterplots of $H_{cr}/H_c$ against $M_{rs}/M_s$ where $H_{cr}$ is the coercivity of remanence, $H_c$ is the coercivity, $M_{rs}$ is the remanent saturation magnetization, and $M_s$ is the saturation magnetization.

Hysteresis loop measurements provide $M_s$ and $H_c$ (as long as the peak applied field is strong enough to reach saturation magnetization), and DC demagnetization measurements provide $M_{rs}$ and $H_{cr}$. This data can be read from .hys and .dcd files respectively. Coercivity is in the units Tesla and remanence is in the units Am^2.

#+BEGIN_SRC python :session py :results output
import re
import codecs
import os

# Declare path to AGM datafiles.
data_path = "../DATASETS/AGM/"
# Get list of datafiles.
files = os.listdir(data_path)
# Extract list of samples that were analysed.
# The names are specific to sample slices (where multiple slices can come from a single sample).
samples = sorted(set([f.split("-")[0] for f in files if f.endswith(".dcd") or f.endswith(".hys")]))

def extract_hys_params(hys_file):
    ''' Extract Ms and Hc from a hysteresis datafile and return in a dict structure.

    hys_file | :str: | Path to the hysteresis datafile.

    Returns: :dict:
    '''
    # Parse datafile into string.
    with codecs.open(hys_file,encoding="utf-8",errors="ignore") as infile:
        data = infile.read()
        # Extract Ms and Hc.
        M_s = re.search("Saturation  \s+(.+?)\s",data).group(1)
        H_c = re.search("Coercivity  \s+(.+?)\s",data).group(1)
    return {"Ms":float(M_s),
            "Hc":float(H_c)}

def extract_dcd_params(dcd_file):
    ''' Extract Mrs and Hcr from a DC demagnetization datafile and return in a dict structure.

    hys_file | :str: | Path to the demagnetization datafile.

    Returns: :dict:
    '''
    # Parse datafile into string.
    with codecs.open(dcd_file,encoding="utf-8",errors="ignore") as infile:
        data = infile.read()
        # Extract Mrs and Hcr.
        M_rs = re.search("Remanence  \s+(.+?)\s",data).group(1)
        H_cr = re.search("Coercivity \(remanent\)  \s+(.+?)\s",data).group(1)
    return {"Mrs":float(M_rs),
            "Hcr":float(H_cr)}

# Provide an example usage of these functions for sample M02 (slice i).
print("Example for sample M02 (H /T; M /Am^2):")
print(extract_hys_params(os.path.join(data_path,"M02.i-2T.hys")))
print(extract_dcd_params(os.path.join(data_path,"M02.i-1T.dcd")))
#+END_SRC

#+RESULTS:
: Example for sample M02 (H /T; M /Am^2):
: {'Ms': 13.58026, 'Hc': 0.01541676}
: {'Mrs': 2.614374, 'Hcr': 0.03023966}

This process can be repeated for all samples (with maximum applied field of 2T for the hysteresis loops), and the x and y variables computed then scatterplotted. The points are colored by the degree of serpentinization where an observation was made.

#+BEGIN_SRC python :session py
import sys
# Import observed degree of serpentinization and colormapping data.
sys.path.insert(0,"../DATASETS/SERP")
from sample_serp import serp,cmap

import matplotlib.pyplot as plt

# Initialize plot.
plt.figure()
# Iterate through sample slices.
for sample in samples:
    # Find the hysteresis datafile that represents measurement to the largest applied magnetic field for active sample slice.
    max_hys_loop_f = sorted([f for f in files if ("2T" in f) and (f"{sample}-" in f) and f.endswith(".hys")])[0]
    # Find a dcd datafile for active sample slice.
    dcd_f = sorted([f for f in files if sample in f and f.endswith(".dcd")])[0]
    # Display which files were used for the active sample slice.
    print(sample,max_hys_loop_f,dcd_f)
    # Extract data from the relevant files for Day Plotting.
    hys_data = extract_hys_params(os.path.join(data_path,max_hys_loop_f))
    dcd_data = extract_dcd_params(os.path.join(data_path,dcd_f))
    M_s,H_c = hys_data["Ms"],hys_data["Hc"]
    M_rs,H_cr = dcd_data["Mrs"],dcd_data["Hcr"]
    # Extract the parent sample name from the sample slice name for color (related to observed degree of serpentinization) assignment.
    sample_name = sample.split(".")[0]
    # Normalize the sample name to those used in the colormapping dictionaries.
    if sample_name == "M01v":
        sample_name = "M01-vein"
    elif sample_name == "M01m":
        sample_name = "M01"
    # Determine color based on the sample's level of serpentinization where observed.
    c = cmap[serp[sample_name]] if sample_name in serp else "gray"
    # Add active sample slice's point onto Day Plot.
    plt.scatter(H_cr/H_c,M_rs/M_s,c=c)
    # Label this point with the sample slice name.
    plt.text(H_cr/H_c,M_rs/M_s,sample)
# Label axes.
plt.ylabel("M_rs/M_s")
plt.xlabel("H_cr/H_c")
# Declare locations of and plot lines that approximately distinguish SD, PSD and MD regions (Day 1977).
psd_md_h = 0.05
sd_psd_h = 0.5
sd_psd_v = 1.5
psd_md_v = 4
domain_boundary_style = {"linestyle":"--","c":"gray"}
plt.axvline(sd_psd_v,**domain_boundary_style)
plt.axvline(psd_md_v,**domain_boundary_style)
plt.axhline(sd_psd_h,**domain_boundary_style)
plt.axhline(psd_md_h,**domain_boundary_style)
# Label SD, PSD and MD regions
plt.text(sd_psd_v,sd_psd_h,"SD",va="bottom",ha="right",c="gray")
plt.text(sd_psd_v+0.2,sd_psd_h-0.1,"PSD",va="top",ha="left",c="gray")
plt.text(psd_md_v+0.2,psd_md_h-0.02,"MD",va="top",ha="left",c="gray")

plt.show()

#+END_SRC

#+RESULTS:
: None

There appears to be a clear separation between partially (green) and heavily (purple) serpentinized samples, with the partially serpentinized samples plotting more so in the MD region and the heavily serpentinized samples plotting more so in the PSD region.
